load_tests/results_baseline_concerts.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /concerts
Document Length:        325 bytes

Concurrency Level:      100
Time taken for tests:   0.568 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      470000 bytes
HTML transferred:       325000 bytes
Requests per second:    1760.03 [#/sec] (mean)
Time per request:       56.817 [ms] (mean)
Time per request:       0.568 [ms] (mean, across all concurrent requests)
Transfer rate:          807.83 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.0      1       6
Processing:     9   54   8.4     54      73
Waiting:        2   41   9.1     43      69
Total:         10   55   7.7     55      74

Percentage of the requests served within a certain time (ms)
  50%     55
  66%     56
  75%     57
  80%     57
  90%     67
  95%     67
  98%     71
  99%     73
 100%     74 (longest request)