load_tests/results_baseline_health.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /health
Document Length:        20 bytes

Concurrency Level:      100
Time taken for tests:   0.547 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      164000 bytes
HTML transferred:       20000 bytes
Requests per second:    1827.76 [#/sec] (mean)
Time per request:       54.712 [ms] (mean)
Time per request:       0.547 [ms] (mean, across all concurrent requests)
Transfer rate:          292.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.9      1       5
Processing:     6   52   7.5     53      72
Waiting:        2   40   8.4     41      57
Total:          7   53   6.9     55      72

Percentage of the requests served within a certain time (ms)
  50%     55
  66%     56
  75%     56
  80%     56
  90%     57
  95%     59
  98%     72
  99%     72
 100%     72 (longest request)