load_tests/results_high_concerts.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /concerts
Document Length:        325 bytes

Concurrency Level:      1000
Time taken for tests:   5.642 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      4700000 bytes
HTML transferred:       3250000 bytes
Requests per second:    1772.38 [#/sec] (mean)
Time per request:       564.212 [ms] (mean)
Time per request:       0.564 [ms] (mean, across all concurrent requests)
Transfer rate:          813.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   12  10.2      9      54
Processing:    56  537  75.8    535     669
Waiting:        2  419  78.1    426     617
Total:         56  548  68.9    546     673

Percentage of the requests served within a certain time (ms)
  50%    546
  66%    553
  75%    565
  80%    581
  90%    630
  95%    655
  98%    670
  99%    671
 100%    673 (longest request)