load_tests/results_high_health.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /health
Document Length:        20 bytes

Concurrency Level:      1000
Time taken for tests:   5.269 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1640000 bytes
HTML transferred:       200000 bytes
Requests per second:    1898.02 [#/sec] (mean)
Time per request:       526.866 [ms] (mean)
Time per request:       0.527 [ms] (mean, across all concurrent requests)
Transfer rate:          303.98 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   14  11.2     12      57
Processing:    59  501  65.9    506     692
Waiting:        2  357  88.7    356     526
Total:         59  515  58.8    517     695

Percentage of the requests served within a certain time (ms)
  50%    517
  66%    522
  75%    529
  80%    533
  90%    535
  95%    557
  98%    691
  99%    692
 100%    695 (longest request)