load_tests/results_medium_concerts.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /concerts
Document Length:        325 bytes

Concurrency Level:      500
Time taken for tests:   2.969 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      2350000 bytes
HTML transferred:       1625000 bytes
Requests per second:    1684.24 [#/sec] (mean)
Time per request:       296.869 [ms] (mean)
Time per request:       0.594 [ms] (mean, across all concurrent requests)
Transfer rate:          773.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   5.2      4      26
Processing:    40  283  45.0    280     359
Waiting:        2  224  46.5    224     335
Total:         40  288  41.9    287     365

Percentage of the requests served within a certain time (ms)
  50%    287
  66%    296
  75%    307
  80%    312
  90%    348
  95%    355
  98%    360
  99%    360
 100%    365 (longest request)