load_tests/results_spike_concerts.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /concerts
Document Length:        325 bytes

Concurrency Level:      2000
Time taken for tests:   2.779 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      2350000 bytes
HTML transferred:       1625000 bytes
Requests per second:    1799.34 [#/sec] (mean)
Time per request:       1111.516 [ms] (mean)
Time per request:       0.556 [ms] (mean, across all concurrent requests)
Transfer rate:          825.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   39  26.6     31      98
Processing:   138  930 191.0   1018    1099
Waiting:        2  708 218.7    775    1083
Total:        138  968 170.1   1072    1099

Percentage of the requests served within a certain time (ms)
  50%   1072
  66%   1082
  75%   1089
  80%   1090
  90%   1093
  95%   1094
  98%   1096
  99%   1098
 100%   1099 (longest request)