load_tests/results_spike_health.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /health
Document Length:        20 bytes

Concurrency Level:      2000
Time taken for tests:   2.725 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      820000 bytes
HTML transferred:       100000 bytes
Requests per second:    1834.78 [#/sec] (mean)
Time per request:       1090.052 [ms] (mean)
Time per request:       0.545 [ms] (mean, across all concurrent requests)
Transfer rate:          293.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   40  31.5     39     101
Processing:   144  901 263.6    980    1230
Waiting:        2  704 234.8    753    1043
Total:        144  941 245.4   1001    1233

Percentage of the requests served within a certain time (ms)
  50%   1001
  66%   1091
  75%   1097
  80%   1101
  90%   1118
  95%   1230
  98%   1231
  99%   1232
 100%   1233 (longest request)